In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../Book.csv")

In [3]:
df

    Sno.    Company      Name   ID Category       Salary          Position
0      1        NaN       Sam  311      NaN    $400,000     Senior Manager
1      2       Mcsw    Jacson  211     Male    $452,734            Manager
2      3      Apple   Ziddain  411     Male    $300,000        Chairperson
3      4        HCL    Pratik  312     Male          NaN        Chief Head
4      5    Infosys  Chandran  611   Female    $710,000   Senior Executive
5      6  Accenture   Jolliot  711      NaN    $501,900       Spokesperson
6      7  Capgemini    Canger  310     Male    $501,565                NaN
7      8        NaN    Ayushi  312   Female    $567,299   Sinior Consulant
8      9    Siemens    Pushpa  313   Female          NaN               NaN
9     10    Diloitt  Shaharan  511     Male    $898,900   Senior Consulant
10    11     Google    Sundar  101      NaN  $9,000,101                CEO

In [4]:
df.drop(["Sno.","Name","ID","Category","Company"],axis=1,inplace=True)

In [18]:
def clean(sal):
    if isinstance(sal,str):
        sal = sal.strip()
        if "$" in sal:
            sal = sal.replace("$","")
        if "," in sal:
            sal = sal.replace(",","")
        return int(sal)

In [19]:
df["Salary"].apply(clean)

0      400000.0
1      452734.0
2      300000.0
3           NaN
4      710000.0
5      501900.0
6      501565.0
7      567299.0
8           NaN
9      898900.0
10    9000101.0
Name: Salary, dtype: float64